---
kind: property
id: P:Autodesk.Revit.DB.FamilySizeTableErrorInfo.InvalidRowIndex
source: html/ef9ef0c9-d677-e1a4-c742-72ac38f9b5e9.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorInfo.InvalidRowIndex Property

The index of the invalid row.

## Syntax (C#)
```csharp
public int InvalidRowIndex { get; }
```